import random

MonsterList = ['격잔','고대레셴','나나','나르가','네로미','넬기','뚀','기르','쟈그','디노','디노아종','디아','흑디아','발킨','라잔','레우스','창화','은화','레이아','앵화','금화','맘타','모넬','무페토','미블','밀라','바젤','발하','벞바','베히','벨리','볼보','브라키','임계','얀가','안이','안쟈','안쟈아종','알바','얼칼벨','얼찌레','오도','오도아종','간킨','이벨','제노','찡오','짭오','치치','쿠루루','크샬','키린','테오','토비','독비','티가','흑티가','파오우','잠오우','푸케','수케']

GS = ['대검',['깡딜', '속성','라비나']]
LS = ['태도',['깡딜', '속성','라비나']]
SS = ['손검',['깡딜', '속성','라비나']]
DB = ['쌍검',['깡딜', '속성','라비나']]
H = ['해머',['깡딜', '속성']]
HH = ['수렵피리',['깡딜', '속성']]
L = ['랜스',['깡딜', '속성','라비나']]
GL = ['건랜스',['깡딜', '속성','풀버','방사','콕펑']]
CB = ['차지액스',['유탄초고출', '속성초고출','유탄도끼','속성도끼']]
SA = ['슬래시액스',['깡딜', '속성','매미']]
IG = ['조충곤',['깡딜', '속성','초고충력','벌레술사']]
B = ['활',['깡딜', '용문','라비나']]
LB = ['라이트보우건',['통상', '속성','산탄','철갑','관통']]
HB = ['헤비보우건',['통상', '속성','산탄','철갑','관통','매미']]

WeaponList = [GS, LS, SS, DB, H, HH, L, GL, CB, SA, GL, B, LB, HB]

A = random.choice(WeaponList)
B = A[0]
C = random.choice(A[1])

print('Monster')
print(random.choice(MonsterList))
print('Weapon')
print(B)
print('Custom')
print(C)
